#!/usr/bin/env python

# Оператор сложения +
# print(2 + 3)

# Оператор вычитания -
# print(3 - 2)

# Оператор умножения *
# print(3 * 2)

# Оператор возведения в степень **
# print(3 ** 2)

# Оператор деления /
# print(3 / 2)

# Оператор целочисленного деления //
# print(3 // 2)

# Оператор деления по модулю % (возвращает остаток от деления)
# print(7 % 4)

# Оператор битового сдвига влево << (3 = 0000011(2 + 1) << 2 -> 0001100(8 + 4))
# print(3 << 2)

# Оператор битового сдвига вправо >> (17 = 10001(16 + 1) >> 2 -> 00100(4))
# print(17 >> 2)

# Оператор побитовое И & (3 = 11(2 + 1) & 2 = 10(2) -> 10(2))
# print(3 & 2)

# Оператор побитового ИЛИ | (3 | 2 -> 3)
# print(3 | 2)

# Оператор побитовое НЕ ~ (~3 -> -4)
# print(~3)

# Оператор МЕНЬШЕ < (3 < 2 -> False)
# print(3 < 2)

# Оператор БОЛЬШЕ > (3 > 2 -> True)
# print(3 > 2)

# Оператор МЕНЬШЕ ИЛИ РАВНО <= (3 <= 2 -> False)
# print(3 <= 2)

# Оператор БОЛЬШЕ ИЛИ РАВНО >= (3 >= 2 -> True)
# print(3 >= 2)

# Оператор РАВНО == (3 == 2 -> False)
# print(3 == 2)

# Оператор НЕ РАВНО != (3 != 2 -> True)
# print(3 != 2)

# Оператор ЛОГИЧЕСКОЕ НЕ not (x = True; not x -> False)
x = True
# print(not x)

# Оператор ЛОГИЧЕСКОЕ И and (x = True; y = False; x and y -> False)
x = True
y = False
# print(x and y)

# Оператор ЛОГИЧЕСКОЕ ИЛИ or (x = True; y = False; x or y -> True)
x = True
y = False
print(x or y)
